{"config": [{"config": {"stateful": false, "name": "lstm_1", "unroll": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "batch_input_shape": [null, 10, 5], "unit_forget_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "units": 20, "kernel_constraint": null, "implementation": 1, "use_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5"}