{"backend": "tensorflow", "keras_version": "2.1.5", "config": {"output_layers": [["sequential_2", 1, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 10, 5], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "sequential_1", "config": [{"config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "batch_input_shape": [4, 10, 5], "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "name": "lstm_1", "units": 16, "implementation": 1, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"alpha": 0.05000000074505806, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "name": "lstm_2", "units": 32, "implementation": 1, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"alpha": 0.05000000074505806, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.5, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"dropout": 0.0, "activity_regularizer": null, "return_sequences": false, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "name": "lstm_3", "units": 64, "implementation": 1, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "units": 5, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "sequential_2", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "batch_input_shape": [8, 10, 5], "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "units": 32, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "units": 64, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "units": 128, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_5", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "units": 220, "name": "dense_5", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "units": 1, "name": "dense_6", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}]}, "class_name": "Model"}