{"config": {"name": "model_2", "layers": [{"name": "input_2", "config": {"name": "input_2", "batch_input_shape": [null, 10, 5], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "sequential_3", "config": [{"config": {"activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "batch_input_shape": [4, 10, 5], "go_backwards": false, "bias_regularizer": null, "name": "lstm_4", "stateful": false, "kernel_constraint": null, "implementation": 1, "units": 16, "return_sequences": true, "trainable": true, "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0, "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "leaky_re_lu_6", "alpha": 0.05000000074505806, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "name": "lstm_5", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "implementation": 1, "units": 32, "trainable": true, "return_sequences": true, "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "use_bias": true, "dropout": 0.0, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "leaky_re_lu_7", "alpha": 0.05000000074505806, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "name": "lstm_6", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "implementation": 1, "units": 64, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "use_bias": true, "dropout": 0.0, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "name": "dense_7", "kernel_constraint": null, "bias_constraint": null, "units": 5}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "sequential_4", "config": [{"config": {"trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [8, 10, 5], "use_bias": true, "name": "dense_8", "kernel_constraint": null, "units": 32, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_8", "alpha": 0.009999999776482582, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "name": "dense_9", "kernel_constraint": null, "bias_constraint": null, "units": 64}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_9", "alpha": 0.009999999776482582, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "name": "dense_10", "kernel_constraint": null, "bias_constraint": null, "units": 128}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_10", "alpha": 0.009999999776482582, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "name": "dense_11", "kernel_constraint": null, "bias_constraint": null, "units": 220}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "name": "dense_12", "kernel_constraint": null, "bias_constraint": null, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "inbound_nodes": [[["sequential_3", 1, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["sequential_4", 1, 0]]}, "keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow"}