{"config": [{"config": {"trainable": true, "implementation": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": false, "dropout": 0.0, "return_sequences": false, "dtype": "float32", "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "activation": "tanh", "return_state": false, "unroll": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "bias_constraint": null, "units": 20, "batch_input_shape": [null, 10, 5], "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "stateful": false, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}