{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "name": "lstm_1", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "unit_forget_bias": true, "return_state": false, "batch_input_shape": [null, 10, 5], "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": false, "units": 20, "implementation": 1, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "stateful": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "bias_constraint": null, "units": 1}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_1", "trainable": true}}]}